Notes/daily/2021-10-25.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-10-25</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2021-10-25</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2021-10-29.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7042197">Today's task list</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7042197" class="outline-2">
<h2 id="org7042197">Today's task list</h2>
<div class="outline-text-2" id="text-org7042197">
<ul class="org-ul">
<li class="on"><code>[X]</code> Complete the page of the PPR (in your 'Planning' folder) up to the Mid Project Review.</li>
<li class="on"><code>[X]</code> License or get permission for all assets on the website</li>
<li class="off"><code>[&#xa0;]</code> Copy the PPR to documents
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Get permission from OCR to publish PPR</li>
<li class="off"><code>[&#xa0;]</code> Copy it over</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Templates should be created for daily diary notes</li>
<li class="off"><code>[&#xa0;]</code> Go to Moodle and look at the 'Examples of projects from Hills students'.
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Make notes on these examples
<ul class="org-ul">
<li>What are the strengths and weaknesses?</li>
<li>What can you learn from these?</li>
<li>How will this influence the way you work?</li>
</ul></li>
</ul></li>
</ul>

<p>
Yesterday I completed a few of the tasks I wanted to, I got up to completing part of the PPR, so that's the first thing I'm going to be focusing on today.
&#x2014;
I've now completed the PPR up until the stage where I have to (and emailed OCR for permission to publish it, as they hold the copyright to that document), and noticed that I haven't yet licensed the image in <a href="file:///home/runner/School/EPQ/Documents/poem-based-on-an-image.html">the poem I wrote based on the image</a>&#x2026; oops! My next task will be to get a license for that.
</p>

<p>
To do this, I reverse-image-searched the image using <a href="https://tineye.com/">tineye</a>, looking specifically for stock images. I then headed over to <a href="https://www.123rf.com">123rf</a> and used their free trial (10 free stock images) in order to download the image under their standard license. I'm hoping that any more stock-image usage happens within the next month, as then I likely won't have to pay for licenses to any other stock images (credits don't roll over if you cancel your plan).
</p>

<p>
Finally, I downloaded a higher-resolution version of the image and put it onto the poem page.
</p>

<p>
All other assets on my website were created by me (excluding the voice recording, which also contains Pinea, I've already asked them for permission to publush this), so I don't need to get licenses to anything else right now. I will create a new task that I would like to
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Make a credits.org page displaying links to everything and everyone that's helped me in getting this project</li>
</ul>
<p>
I feel like this is an important addition, as I will rely on a lot of stuff in this project, and I want people to be adequately credited, cited &amp; soforth.
</p>

<p>
I'm also going to add a further quality-of-life task:
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Add a link back to the main page from each page on the site, as well as a link to the source on github</li>
</ul>
</div>
</div>
</div>
</body>
</html>
